# 1. VSU基本配置

**1、VSU基本配置**

**1、对主备核心交换机进行初始配置**

核心交换机1：

```text
Switch1>en

Switch1# configure terminal

Switch1# configure terminal

Enter configuration commands, one per line. End with CNTL/Z.

Switch1(config)# switch virtual domain 1

Switch1(config-vs-domain)# switch 1

Switch1(config-vs-domain)#switch 1 priority 200    
//默认优先级为100，配置为较高的优先级，VSU建立成功后将会成为管理主机。

Switch1(config-vs-domain)# exit

Switch1(config)#vsl-port       
//VSL链路至少需要2条，一条链路可靠性较低，当出现链路震荡时，VSU会非常不稳定。

Switch1(config-vsl-ap-1)# port-member interface TenGigabitEthernet 2/1           
//配置VSL链路

Switch1(config-vsl-ap-1)# port-member interface TenGigabitEthernet 2/2

Switch1(config-vsl-ap-1)# exit
```

核心交换机2：

```text
Switch2# configure terminal

Enter configuration commands, one per line. End with CNTL/Z.

Switch2(config)# switch virtual domain 1  
//domaind id 必须和第一台一致

Switch2(config-vs-domain)#switch 2    
//第二台设备必须更改ID为2

Switch2(config-vs-domain)#switch 2 priority 150

Switch2(config-vs-domain)# exit

Switch2(config)#vsl-port            
//VSL链路至少需要2条，一条链路可靠性较低，当出现链路震荡时，VSU会非常不稳定。

Switch2(config-vsl-ap-1)# port-member interface TenGigabitEthernet 2/1        
//配置VSL链路

Switch2(config-vsl-ap-1)# port-member interface TenGigabitEthernet 2/2

Switch2(config-vsl-ap-1)# exit
```

**2、连接好VSL链路，并确定接口已经UP**

**3、保存两台设备的配置，并一起切换为VSU模式**

核心交换机1

```text
Switch1# wr

Switch1# switch convert mode virtual         
//转换为VSU模式

Convert mode will backup and delete config file, and reload the switch. Are you sure to continue[yes/no]：yes

Do you want to recover config file from backup file in standalone mode (press 'ctrl + c' to cancel) [yes/no]：no
```

no表示清空重配， 

核心交换机2

```text
Switch2# wr

Switch2# switch convert mode virtual  
//转换为VSU模式

Are you sure to convert switch to virtual mode[yes/no]：yes

Do you want to recover config file from backup file in virtual mode (press 'ctrl + c' to cancel) [yes/no]：no
```

选择转换模式后，设备会重启启动，并组建VSU。

**4、确认VSU建立成功**

1.VSU的管理需要在其中的主机上进行

2. VSU主机的引擎Primary灯绿色常亮，VSU从机的Primary灯灭，可以用来判断主从机关系（ 设备优先级提前有指定，高优先级的设备会成为主机）

3. VSU组建后从机Console口默认不能进行管理，可执行EscEscEscEscC（即4次Esc键加C键）打开输出开关,建议使用session device 2 slot （m1,m2 ,线卡槽位）登录其它设备查看信息。

Ruijie\# show switch virtual role  检查主备是否符合预期

```text
Switch_id    Domain_id    Priority    Position    Status    Role       Description                     
---------    ---------    --------    --------    ------    ----       -----------
1(1)         100(100)     200(200)    LOCAL       OK        ACTIVE     switch-1    ------>ACTIVE表示主机箱                         
2(2)         100(100)     150(150)    REMOTE      OK        STANDBY    switch-2    ------>STANDBY表示从机箱 
```

Ruijie\# show ver slots  检查是否已经识别到了主从机的所有线卡（说明以下结果仅为示例）

```text
Dev   Slot  Port    Configured Module      Online Module            Software Status
---   ----  ----    -----------------      -------------            --------------- 
1     1     0       none                   none                     none          
1     2     0       none                   none                     none          
1     3     8       M18000-08XS-ED         M18000-08XS-ED           ok            
1     4     0       none                   none                     none          
1     5     48      M18000-24GT20SFP4XS-ED M18000-24GT20SFP4XS-ED   ok            
1     6     0       none                   none                     none          
1     7     7       RG-WALL 1600-B-ED      RG-WALL 1600-B-ED        ok            
1     8     0       none                   none                     none          
1     FE1   0       N/A                    M18010-FE-D I            ok            
1     FE2   0       N/A                    M18010-FE-D I            ok            
1     FE3   0       N/A                    none                     none          
1     FE4   0       N/A                    none                     none          
1     M1    0       N/A                    M18010-CMII              master        
1     M2    0       N/A                    none                     none          
2     1     0       none                   none                     none          
2     2     0       none                   none                     none          
2     3     8       M18000-08XS-ED         M18000-08XS-ED           ok            
2     4     0       none                   none                     none          
2     5     48      M18000-24GT20SFP4XS-ED M18000-24GT20SFP4XS-ED   ok            
2     6     0       none                   none                     none          
2     7     7       RG-WALL 1600-B-ED      RG-WALL 1600-B-ED        ok            
2     8     0       none                   none                     none          
2     FE1   0       N/A                    none                     none          
2     FE2   0       N/A                    M18010-FE-D I            ok            
2     FE3   0       N/A                    none                     none          
2     FE4   0       N/A                    none                     none          
2     M1    0       N/A                    none                     none          
2     M2    0       N/A                    M18010-CMII              backup  
```

